InformationRegisters/ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОтправкиСМС_СД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ШаблоныОтправкиСМС_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныОтправкиСМС_СД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМСПоСтатусуНовойПочты/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СМС клиенту при смене статуса Новой Почты.
//
// Вызывается из регламента обновления статусов НП (МодульНовойПошты_СД,
// обработчик getStatusDocuments) — сразу после того, как заказу записан
// новый статус.
//
// Отправляем один раз на заказ, когда отправление впервые оказалось «в пути».
// Повтор невозможен: перед отправкой смотрим в регистр ОтправленныеСообщения,
// не уходило ли уже сообщение этим шаблоном по этому заказу.
//
// Рассылка намеренно узкая — только заказы одного ответственного и только
// начиная с даты старта: обкатываем на части потока, а не на всех 1400
// заказах в месяц.
//
////////////////////////////////////////////////////////////////////////////////

// Отправляет СМС по заказу, если выполнены все условия рассылки.
// Ничего не возвращает и не выбрасывает исключений: регламент не должен падать
// из-за СМС, все отказы уходят в журнал регистрации.
//
// Параметры
//  ЗаказСсылка - ДокументСсылка.ЗаказПокупателя
//
Процедура ОтправитьПриСменеСтатуса(ЗаказСсылка) Экспорт
	
	Попытка
		
		Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗаказПодходитДляРассылки(ЗаказСсылка) Тогда
			Возврат;
		КонецЕсли;
		
		Шаблон = ШаблонДляЗаказа(ЗаказСсылка);
		Если Не ЗначениеЗаполнено(Шаблон) Тогда
			ВЖурнал(ЗаказСсылка, "Не найден шаблон СМС для подразделения " + Строка(ЗаказСсылка.Подразделение),
				УровеньЖурналаРегистрации.Предупреждение);
			Возврат;
		КонецЕсли;
		
		Если УжеОтправляли(ЗаказСсылка, Шаблон) Тогда
			Возврат;
		КонецЕсли;
		
		Телефон = СокрЛП(ЗаказСсылка.НП_ТелефонПолучателя);
		Если ПустаяСтрока(Телефон) Тогда
			Телефон = СокрЛП(ЗаказСсылка.Телефон);
		КонецЕсли;
		
		Если ПустаяСтрока(Телефон) Тогда
			ВЖурнал(ЗаказСсылка, "СМС по статусу НП не отправлено: не заполнен телефон получателя",
				УровеньЖурналаРегистрации.Предупреждение);
			Возврат;
		КонецЕсли;
		
		Текст = ТурбоСМС_ОбщийМодуль_СД.ПолучитьТекстСМС(Шаблон, ЗаказСсылка);
		Если ПустаяСтрока(СокрЛП(Текст)) Тогда
			ВЖурнал(ЗаказСсылка, "СМС по статусу НП не отправлено: пустой текст по шаблону " + Строка(Шаблон),
				УровеньЖурналаРегистрации.Предупреждение);
			Возврат;
		КонецЕсли;
		
		Результат = СенсорныйЕкран_Оплата_СД.ОтправитьСМС(ЗаказСсылка, Телефон, Текст, Шаблон);
		
		Если Результат.Успешно Тогда
			ВЖурнал(ЗаказСсылка, "СМС по статусу НП «" + Строка(ЗаказСсылка.НП_Статус) + "» отправлено на " + Телефон,
				УровеньЖурналаРегистрации.Информация);
		Иначе
			ВЖурнал(ЗаказСсылка, "СМС по статусу НП не отправлено: " + Результат.Сообщение,
				УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;
		
	Исключение
		ВЖурнал(ЗаказСсылка, "Сбой отправки СМС по статусу НП: " + ОписаниеОшибки(),
			УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
КонецПроцедуры

// Проверяет заказ по условиям рассылки: дата, ответственный, наличие ТТН,
// статус «в пути».
//
Функция ЗаказПодходитДляРассылки(ЗаказСсылка) Экспорт
	
	Если ЗаказСсылка.Дата < ДатаНачалаРассылки() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОтветственныеРассылки().Найти(ЗаказСсылка.Ответственный) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(СокрЛП(ЗаказСсылка.НП_ТТН)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтатусВПути(ЗаказСсылка.НП_Статус);
	
КонецФункции

// Дата, с которой рассылка работает. Заказы старше не трогаем: иначе первый же
// прогон регламента разослал бы СМС по всем накладным за месяц, которые он
// опрашивает.
//
Функция ДатаНачалаРассылки() Экспорт
	
	Возврат '20260903';
	
КонецФункции

// Ответственные, по чьим заказам идёт рассылка.
//
// Список намеренно короткий — обкатка. Добавить менеджера: дописать строку
// в массив ниже (сравнение по наименованию пользователя).
//
Функция ОтветственныеРассылки() Экспорт
	
	Имена = Новый Массив;
	Имена.Добавить("Ходоровська Вероніка");
	
	Ответственные = Новый Массив;
	Для Каждого Имя Из Имена Цикл
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Имя, Истина);
		Если ЗначениеЗаполнено(Пользователь) Тогда
			Ответственные.Добавить(Пользователь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ответственные;
	
КонецФункции

// Считается ли статус «отправление в пути».
//
// Идём от обратного: перечислять все «в пути» бессмысленно — в справочнике
// НП_Статусы их полторы сотни, по городу на каждый. Поэтому отсекаем то, что
// в пути заведомо не является: ещё не передано перевозчику, уже получено,
// отменено. Всё остальное — в пути.
//
Функция СтатусВПути(Статус) Экспорт
	
	Наименование = СокрЛП(Строка(Статус));
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Начала = Новый Массив;
	// Ещё не у перевозчика.
	Начала.Добавить("Відправник самостійно створив");
	Начала.Добавить("Нова пошта очікує надходження");
	Начала.Добавить("Готується до відправлення");
	// Уже закончено.
	Начала.Добавить("Відправлення отримано");
	Начала.Добавить("Отримана");
	Начала.Добавить("Відмова від отримання");
	Начала.Добавить("Припинено зберігання");
	Начала.Добавить("Знищено");
	Начала.Добавить("Видалено");
	Начала.Добавить("Номер не знайдено");
	
	Для Каждого Начало Из Начала Цикл
		Если Лев(Наименование, СтрДлина(Начало)) = Начало Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Шаблон СМС по бренду подразделения заказа.
//
// Бренд определяем по настройке ТурбоСМС подразделения («Garazh.UA»,
// «ionity.tires») — она же задаёт имя отправителя, так что шаблон и подпись
// в сообщении всегда от одного бренда.
//
Функция ШаблонДляЗаказа(ЗаказСсылка) Экспорт
	
	КодGarazh = "000000009";   // Нова  Почта - ТТН (Garazh.UA)
	КодIonity = "000000018";   // Нова  Почта - ТТН (ionity.tires)
	
	Код = КодGarazh;
	
	Настройка = "";
	Попытка
		Настройка = НРег(СокрЛП(Строка(ЗаказСсылка.Подразделение.НастройкаТурбоСМС_СД)));
	Исключение
		Настройка = "";
	КонецПопытки;
	
	Если Найти(Настройка, "ionity") > 0 Тогда
		Код = КодIonity;
	КонецЕсли;
	
	Шаблон = Справочники.ШаблоныОтправкиСМС_СД.НайтиПоКоду(Код);
	
	Если ЗначениеЗаполнено(Шаблон) И Шаблон.ПометкаУдаления Тогда
		Возврат Справочники.ШаблоныОтправкиСМС_СД.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Шаблон;
	
КонецФункции

// Отправляли ли уже сообщение этим шаблоном по этому заказу.
//
// Ключ дедупликации — регистр ОтправленныеСообщения: реквизиты заказа хранят
// только последнее СМС и для проверки не годятся.
//
Функция УжеОтправляли(ЗаказСсылка, Шаблон) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", ЗаказСсылка);
	Запрос.УстановитьПараметр("Шаблон"  , Шаблон);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтправленныеСообщения.Период
	|ИЗ
	|	РегистрСведений.ОтправленныеСообщения КАК ОтправленныеСообщения
	|ГДЕ
	|	ОтправленныеСообщения.Документ = &Документ
	|	И ОтправленныеСообщения.Шаблон = &Шаблон";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Запись в журнал регистрации под своим событием, чтобы рассылку можно было
// смотреть отдельно от остального шума регламента.
//
Процедура ВЖурнал(ЗаказСсылка, Текст, Уровень)
	
	Попытка
		ЗаписьЖурналаРегистрации("Новая Почта.СМС по статусу", Уровень, , ЗаказСсылка, Текст);
	Исключение
	КонецПопытки;
	
КонецПроцедуры
